system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     interFoam;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         30;

deltaT          0.00001;

writeControl    adjustableRunTime; //adjustableRunTime;

writeInterval   0.2;

purgeWrite      0;

writeFormat     ascii;

writePrecision  8;

writeCompression off;

timeFormat      general;

timePrecision   7;

runTimeModifiable off;

adjustTimeStep  off; //off, no

maxCo           1;
maxAlphaCo      1;
maxDeltaT       1;
wallShearStress1
{
    // Mandatory entries (unmodifiable)
    type        wallShearStress;
    libs        (fieldFunctionObjects);

    // Optional entries (runtime modifiable)
    patches     ("concretewall" "pipe2" "alcantarillado" "disipador");   
    // Optional (inherited) entries
}
functions
{
surfaces
{
libs ("libsampling.so");
type surfaces;
writeControl outputTime;
writeInterval 1;
interpolationScheme cellPoint;
surfaceFormat raw;
surfaces
(
freeSurface
{
type isoSurface;
isoField alpha.water;
isoValue 0.7;
interpolate true;
}
);
fields ( alpha.water );
}
};


// ************************************************************************* //
