system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default         Euler;
}

gradSchemes
{
    default         Gauss linear;
}

divSchemes
{
    div(rhoPhi,U)   Gauss linearUpwind grad(U);
    div(phi,alpha)  Gauss vanLeer;
    div(phirb,alpha) Gauss linear;
    div(rhoPhi,k)      Gauss upwind;
    div(rhoPhi,epsilon) Gauss upwind;
    div(((rho*nuEff)*dev2(T(grad(U))))) Gauss linear;
    div(div(phi,U)) Gauss linear;
    "div\(phi,(k|omega)\)" Gauss upwind;
    
}

laplacianSchemes
{
    default         Gauss linear orthogonal;
}

laplacianSchemes
{
    default         Gauss linear corrected;
}


interpolationSchemes
{
    default         linear;
}

snGradSchemes
{
    default         orthogonal;
}
wallDist
{
method meshWave;
}


// ************************************************************************* //
